Config/Catalogs/ВидыПриказовОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыПриказовОбразование</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СостояниеСтудента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСтудентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеДополнительнойУслугой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПоляПриказовОбразование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заполнять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаполнениеОбязательно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказыватьПредыдущееЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПоляПриказовОбразование</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/ПриказОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриказОбразование</Name>
			<BasedOn>
				<xr:Item>Catalog.Студенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияОПрочихУслугахСтудентам</xr:Item>
				<xr:Item>InformationRegister.СведенияОСтудентах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факультет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФакультетДокументаДопУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПриказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПриказовОбразование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Студенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПоляПриказовОбразование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПоляПриказовОбразование</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтудентыДопУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислениеСтудентамЗаПрочиеУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НачисленияСтудентамЗаПрочиеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготыСтудентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокВыпискиСФ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокВыпискиСФЗаУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/ВидыПриказовОбразование/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	УстановитьСостояниеСтудента = НЕ Объект.СостояниеСтудента.Пустая();
	
	Если Объект.УправлениеДополнительнойУслугой = 1 Тогда
		ИнициализироватьЗначенияРеквизитов();
	КонецЕсли;
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);   
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьСостояния();
	УстановитьВидимостьСтраниц();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		Если УстановитьСостояниеСтудента И Объект.СостояниеСтудента.Пустая() Тогда
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Поле "" Состояние "" не заполнено'"),, "Объект.СостояниеСтудента",, Отказ );
				
		ИначеЕсли НЕ УстановитьСостояниеСтудента Тогда
			
			Объект.СостояниеСтудента = Неопределено;
		
		КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ДопУслуга = (ТекущийОбъект.УправлениеДополнительнойУслугой = 1);
	
	Если ДопУслуга Тогда
		Если ТекущийОбъект.Поля.Количество() > 0 Тогда
			Стр = ТекущийОбъект.Поля[0];
		Иначе
			Стр = ТекущийОбъект.Поля.Добавить();
		КонецЕсли;
		
		Стр.Поле = Поле;
		Стр.Заполнять = Заполнять;
		Стр.ЗаполнениеОбязательно = ЗаполнениеОбязательно;
		Стр.ЗначениеПоУмолчанию = ЗначениеПоУмолчанию;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УстановитьСостояниеСтудентаПриИзменении(Элемент)
	
	УстановитьДоступностьСостояния();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДополнительнойУслугойПриИзменении(Элемент)
	УстановитьВидимостьСтраниц();
	ПредварительнаяНастройкаВидПриказа();
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовСтраницыДополнительнаяУслуга

&НаКлиенте
Процедура ЗначениеПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборСписка", Новый Структура("РазовоеНачисление", Ложь));
	
	ОткрытьФорму("Справочник.НачисленияСтудентамЗаПрочиеУслуги.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЧастиПоля

&НаКлиенте
Процедура ПоляЗаполнятьПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Поля.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока.Заполнять Тогда
		
		ТекущаяСтрока.ЗаполнениеОбязательно = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик команды, создаваемой механизмом запрета редактирования ключевых реквизитов.
//
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		Если МожноРедактироватьРеквизиты() Тогда
			
			МассивРеквизитов = ЗапретРедактированияРеквизитовОбъектовКлиент.Реквизиты(ЭтаФорма);
			ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, МассивРеквизитов);
			
		Иначе
			
			ПоказатьПредупреждение(Неопределено, "Редактирование ключевых значений запрещено, т.к. вид приказа используется в проведенных документах!", 20);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПоцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьСостояния()
	
	Элементы.СостояниеСтудента.Доступность = УстановитьСостояниеСтудента;
	Элементы.СостояниеСтудента.АвтоОтметкаНезаполненного = УстановитьСостояниеСтудента;
	
КонецПроцедуры

&НаСервере
Функция МожноРедактироватьРеквизиты()
		
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Приказ.Ссылка
	               |ИЗ
	               |	Документ.ПриказОбразование КАК Приказ
	               |ГДЕ
	               |	Приказ.ВидПриказа = &ВидПриказа
	               |	И Приказ.Проведен";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВидПриказа", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();

КонецФункции // МожноРедактироватьРеквизиты()

&НаКлиенте
Процедура УстановитьВидимостьСтраниц()
	ДопУслуга = (Объект.УправлениеДополнительнойУслугой = 1);
	
	Элементы.Настройки.Видимость = Не ДопУслуга;
	Элементы.ПроведениеДокумента.Видимость = Не ДопУслуга;
	Элементы.ДополнительнаяУслуга.Видимость = ДопУслуга;
	
	Элементы.СтраницыНастройки.ОтображениеСтраниц = ?(ДопУслуга, ОтображениеСтраницФормы.Нет, ОтображениеСтраницФормы.ЗакладкиСверху);
КонецПроцедуры

&НаСервере
Процедура ПредварительнаяНастройкаВидПриказа()
	Объект.Поля.Очистить();
	ДопУслуга = (Объект.УправлениеДополнительнойУслугой = 1);
	
	Если ДопУслуга Тогда
		Поле = ПланыВидовХарактеристик.ПоляПриказовОбразование.ДополнительнаяУслуга;
		Элементы.ЗначениеПоУмолчанию.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.НачисленияСтудентамЗаПрочиеУслуги");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьЗначенияРеквизитов()
	Если Объект.Поля.Количество() > 0 Тогда
		Стр = Объект.Поля[0];
		Поле = Стр.Поле;
		Заполнять = Стр.Заполнять;
		ЗаполнениеОбязательно = Стр.ЗаполнениеОбязательно;
		ЗначениеПоУмолчанию = Стр.ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Элементы.ЗначениеПоУмолчанию.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.НачисленияСтудентамЗаПрочиеУслуги");
КонецПроцедуры

&НаКлиенте
Процедура ПоляПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НЕ ОтменаРедактирования Тогда
		ТекущиеДанные = Элементы.Поля.ТекущиеДанные;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Поле", ТекущиеДанные.Поле);
		
		СтрокиПоТекущемуПолю = Объект.Поля.НайтиСтроки(ПараметрыОтбора);
		Если СтрокиПоТекущемуПолю.Количество() > 1 Тогда
			
			ТекстШаблон = НСтр("ru = 'Выбранное поле ""%1"" указано в табличной части повторно! 
				|Одно поле может быть добавлено в таблицу полей только один раз. 
				|Укажите другое значение поля или отмените добавление строки.'");
	        ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстШаблон, ТекущиеДанные.Поле);
			
			ПоказатьПредупреждение(, ТекстПредупреждения, 10);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
